artillery.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  # - flow:
  #     - post:
  #         url: "/users"
  #         json:
  #           name: "Test" 
  #           email: "test@example.com"
  #           password: "Password123"  

  # - flow:
  #     - post:
  #         url: "/users/login"
  #         json:
  #           email: "test@example.com"
  #           password: "Password123"

  - flow:
    - put:
        url: "/users/649b70bb17a8c14cee1fc823"
        header: { Authorization:  } 
        json:
          email: "test@example.com"
          password: "Password123"

  # - flow: 
  #   - delete: 
  #     url: "/users/12345"

  # - flow:
  #   - post:
  #       url: "/books"
  #       json: 
  #         title: "Pilgrim at Tinker Creek"
  #         author: "Annie Dillard"
  #         genre: "Philosophy, Nature"
  #         isbn: 9780000001234
  #         condition: "New"